01Hub/fbedit/STM32F4Discovery/STM32F4_Scope/Scope/main.c
/*******************************************************************************
* Function Name  : WaitForTrigger
* Description    : This function waits for a trigger on CHA, CHB or
*                  logic analyser .
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void WaitForTrigger(void)
{
  // u16 tmp;
  // /* Syncronize with rising or falling edge or logic analyser */
  // switch (STM32_DataStruct.STM32_CommandStruct.STM32_TriggerMode)
  // {
    // case (STM32_TriggerRisingCHA):
      // /* Count on rising edge */
      // TIM2->CCER = 0x0000;
      // /* Wait until TIM2 increments */
      // tmp = TIM2->CNT;
      // while (tmp == TIM2->CNT)
      // {
        // if (STM32_DataStruct.STM32_CommandStruct.TIM3_TimeOut == 0)
        // {
          // break;
        // }
      // }
      // break;
    // case (STM32_TriggerFallingCHA):
      // /* Count on falling edge */
      // TIM2->CCER = 0x0022;
      // /* Wait until TIM2 increments */
      // tmp = TIM2->CNT;
      // while (tmp == TIM2->CNT)
      // {
        // if (STM32_DataStruct.STM32_CommandStruct.TIM3_TimeOut == 0)
        // {
          // break;
        // }
      // }
      // break;
    // case (STM32_TriggerRisingCHB):
      // /* Count on rising edge */
      // TIM4->CCER = 0x0000;
      // /* Wait until TIM4 increments */
      // tmp = TIM4->CNT;
      // while (tmp == TIM4->CNT)
      // {
        // if (STM32_DataStruct.STM32_CommandStruct.TIM3_TimeOut == 0)
        // {
          // break;
        // }
      // }
      // break;
    // case (STM32_TriggerFallingCHB):
      // /* Count on falling edge */
      // TIM4->CCER = 0x0022;
      // /* Wait until TIM4 increments */
      // tmp = TIM4->CNT;
      // while (tmp == TIM4->CNT)
      // {
        // if (STM32_DataStruct.STM32_CommandStruct.TIM3_TimeOut == 0)
        // {
          // break;
        // }
      // }
      // break;
    // case (STM32_TriggerLGA):
      // tmp = STM32_DataStruct.STM32_CommandStruct.LGA_TriggerValue & STM32_DataStruct.STM32_CommandStruct.LGA_TriggerMask;
      // if ((STM32_DataStruct.STM32_CommandStruct.LGA_TriggerEdge != 0) & (STM32_DataStruct.STM32_CommandStruct.LGA_TriggerMask != 0))
      // {
        // /* Edge sensitive */
        // /* Wait while conditions are met */
        // while (((GPIOC->IDR & STM32_DataStruct.STM32_CommandStruct.LGA_TriggerMask) == tmp) & (STM32_DataStruct.STM32_CommandStruct.TIM3_TimeOut != 0))
        // {
        // }
        // /* Wait until conditions are met */
        // while (((GPIOC->IDR & STM32_DataStruct.STM32_CommandStruct.LGA_TriggerMask) != tmp) & (STM32_DataStruct.STM32_CommandStruct.TIM3_TimeOut != 0))
        // {
        // }
        // break;
      // }
      // else
      // {
        // /* Wait until conditions are met */
        // while (((GPIOC->IDR & STM32_DataStruct.STM32_CommandStruct.LGA_TriggerMask) != tmp) & (STM32_DataStruct.STM32_CommandStruct.TIM3_TimeOut != 0))
        // {
        // }
      // }
      // break;
    // default:
      // break;
  // }
}

/*******************************************************************************
* Function Name  : TIM2_IRQHandler
* Description    : This function handles TIM2 global interrupt request.
*                  It increments the TIM2H 16 bit variable on each rollover
*                  of the counter.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
// void TIM2_IRQHandler(void)
// {
  // /* Clear TIM2 Update interrupt pending bit */
  // asm("mov    r1,#0x40000000");
  // asm("strh   r1,[r1,#0x10]");
  // /* Increment STM32_DataStruct.STM32_FRQDataStructCHA.TIMxH */
  // asm("mov    r1,#0x20000000");
  // asm("ldrh   r2,[r1,0xe]");
  // asm("add    r2,r2,0x1");
  // asm("strh   r2,[r1,0xe]");
// }

/*******************************************************************************
* Function Name  : TIM3_IRQHandler
* Description    : This function handles TIM3 global interrupt request.
*                  It calculates the frequency every 1000ms.
*                  Since it calculate the difference between this reading
*                  and the previous reading there is no need to take into
*                  account interrupt overhead.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
// void TIM3_IRQHandler(void)
// {
  // /* Clear TIM3 Update interrupt pending bit */
  // asm("mov    r0,#0x0");
  // asm("movw   r1,#0x0400");
  // asm("movt   r1,#0x4000");
  // asm("strh   r0,[r1,#0x10]");
  // /* Decrement STM32_DataStruct.STM32_CommandStruct.TIM3_TimeOut */
  // asm("mov    r1,#0x20000000");
  // asm("ldrb   r0,[r1,0x2f]");
  // asm("cmp    r0,0x0");
  // asm("itt    ne");
  // asm("subne  r0,r0,0x1");
  // asm("strbne r0,[r1,0x2f]");
  // /* Calculate frequency TIM2 */
  // asm("mov    r0,#0x40000000");
  // asm("mov    r1,#0x20000000");
  // asm("ldrh   r2,[r1,0xe]");        // STM32_DataStruct.STM32_FRQDataStructCHA.TIMxH
  // asm("ldrh   r3,[r0,#0x24]");      // TIM2->CNT
  // asm("orr    r2,r3,r2,lsl #16");   // (STM32_DataStruct.STM32_FRQDataStructCHA.TIMxH << 16) | TIM2->CNT
  // asm("ldr    r3,[r1,0x4]");        // STM32_DataStruct.STM32_FRQDataStructCHA.PreviousCount
  // asm("str    r2,[r1,0x4]");        // STM32_DataStruct.STM32_FRQDataStructCHA.PreviousCount
  // asm("sub    r2,r2,r3");
  // asm("str    r2,[r1,0x0]");        // STM32_DataStruct.STM32_FRQDataStructCHA.Frequency
  // /* Calculate frequency TIM4 */
  // asm("movw   r0,#0x0800");
  // asm("movt   r0,#0x4000");
  // asm("ldrh   r2,[r1,0x1e]");       // STM32_DataStruct.STM32_FRQDataStructCHB.TIMxH
  // asm("ldrh   r3,[r0,#0x24]");      // TIM4->CNT
  // asm("orr    r2,r3,r2,lsl #16");   // (STM32_DataStruct.STM32_FRQDataStructCHB.TIMxH << 16) | TIM4->CNT
  // asm("ldr    r3,[r1,0x14]");       // STM32_DataStruct.STM32_FRQDataStructCHB.PreviousCount
  // asm("str    r2,[r1,0x14]");       // STM32_DataStruct.STM32_FRQDataStructCHB.PreviousCount
  // asm("sub    r2,r2,r3");
  // asm("str    r2,[r1,0x10]");       // STM32_DataStruct.STM32_FRQDataStructCHB.Frequency
// }

